[
  {
    "title": "1. Fibonacci Retracements",
    "content_1": "Fibonacci analysis can be a great asset for judging potential support and resistance levels in the cryptocurrency markets, by using historical price movements. By understanding these levels, decisions can be made about market trends and potential price movements. The important percentages of the Fibonacci Retracement are: 23.6%, 38.2%, and 61.8%. While these three percentages are the foundation, it is also worth considering the 50% and 76.4% levels. However, for a beginner, the percentages: 38.2%, 50%, and 61.8% are more than enough.",
    "image": "images/Fib_Tracement.png",
    "content_2": "This framework is projected onto charts to predict the levels of support or resistance within the market. When the market retraces to 38.2%, this is the first level of support and is closely observed to see if buyers emerge or if it will continue to fall to the 50% support. If this level is also breached, the next level is around the 61.8% retracement point. A breach of the 61.8% level suggests a return to the market's starting point. Not all agree with the Fibonacci Retracement; some see it as a self-fulfilling prophecy. However, even for those who do not agree, it can add an additional layer of insight regarding where the market is on the tip of an edge."
  },
  {
    "title": "2. Cup and Handle",
    "content_1": "The cup and handle are a bullish trading technique to indicate the buying potential of a trade. The pattern is the shape of a cup and handle where the price rises as it comes out of the pattern. It is vital that the handle's formation remains within 15% of the high point of the cup in an upward motion. This pattern takes shape when a stock's price undergoes a \"cup\" phase, succeeded by a brief decline known as the handle. It's crucial that the handle's formation remains within 15% of the high point of the cup, displaying a downward slope rather than an upward one. The formation needs to be a U-shape and must span across a 7-week period, while the handle needs to be over 1 week, developing over the 200-day moving average. The handle should have a downward slope, rather than an upward one.",
    "image": "images/Cup_and_Handle.png",
    "content_2": "It is important that before the pattern can be verified, it needs to complete its formation. The handle should not fall below 15%. If it does, it indicates that the stock isn’t primed for an upward breakout. Another pitfall to avoid is inadequate risk management. While the cup and handle pattern is known for its reliability, traders must remain vigilant to the possibility of occasional failures. Prudent planning should encompass strategies for such scenarios."
  },
  {
    "title": "3. Flag",
    "content_1": "A flag is a pattern that moves in the opposite direction of the current price trend. It assists traders in identifying trends that recommence after a brief pause. Should the trend pick up again, prices are expected to rise rapidly. Flags are compact consolidation areas in the market that emerge after a significant price change. They can be either bullish or bearish. A flag consists of five key components: the prior trend, the narrow trading range, varying trading volume, the price breakout, and finally, the confirmation when the price continues in the breakout direction.",
    "image": "images/123_Pattern.png",
    "content_2": "A flag pattern has lines that run parallel in the consolidation area. When lines come together, it's called a wedge or pennant pattern. These patterns usually form in the market once they appear. The best time to act on this pattern is when it begins. The breakdown and volume patterns are usually consistent as well. After the pattern starts, usually, the price goes down. Because of this, investors are patient when it comes to buying or selling in the market. Retail traders are more likely to jump on this pattern as they are not as experienced as professional traders. Overall, the flag pattern is a valuable tool in the market for identifying the potential continuation of trends."
  },
{
  "title": "4. Double Bottoms",
  "content_1": "A double bottom is one of the foundational technical analyses of a chart that indicates a reversal change in the market. It occurs when a market is in a downward trend and a reversal is likely to happen due to a rebound. The shape of the trend forms a double bottom in the shape of a \"W.\" The double bottom creates a support level that turns the bearish market into a bullish one. This pattern is best used with a medium to long-term view of the market. Once this pattern appears, usually a spike in investments from traders follows. The trough levels must be within a certain range, typically around 3-4% of each other. When the second bottom is higher than the first one, this is another indication that the volume of investment could potentially be significantly higher than if they were within the range of each other. This increase in volume is usually around 10% higher than the previous one. Neckline. This is done by connecting the low points of the two troughs with a horizontal line. ",
  "image": "images/Double_Top_&_Bottom.jpg",
  "content_2": "Double bottoms are considered one of the most important formations when attempting to identify the bottom of a bearish market. Since the pattern is used for an intermediate to long-term indication of the market, it is a significant signal of a prolonged market change. Usually, it may indicate a minimum 20% increase in the market, but it can also lead to much higher market gains. They are among the best visual identifiers. Once these patterns are formed, traders or investors should keep an eye out for an upward move."
},
{
  "title": "5. Double Top",
  "content_1": "A double top is a market trend that indicates a potential reversal from a bullish market to a bearish one. This pattern is only confirmed when the market falls through the previous support level. This market trend provides a medium to long-term indication of the market's direction. The double top pattern starts with an uptrend, followed by an initial peak where the price reaches the maximum level before beginning to fall slightly. After the slight fall, a second peak occurs, but this time the subsequent decline is lower than the first one.\n\nThis second decline, which is lower than the first, breaks the resistance level set by the first decline, often referred to as the neckline. Only when this neckline is broken, the following pattern is considered completed.",
  "image": "images/Double_Top_&_Bottom.jpg",
  "content_2": "Once this neckline has been broken and the pattern is confirmed, it becomes a great selling point as the market has just transitioned from a bullish to a bearish state. This is a suitable pattern for beginner traders as it is one of the more visually recognizable trends and can even be noticed by novice traders. The double top pattern has the potential to be profitable if executed correctly and serves as another solid foundation for a beginner trader."
},
  {
    "title": "6. Elliot Wave",
    "content_1": "The Elliott Wave Theory in technical analysis provides valuable insights into price movements within the financial market. Conceived by Ralph Nelson Elliott, it revolves around identifying recurring fractal wave patterns in stock prices and consumer behavior. These patterns resemble waves that investors can ride to profit from market trends. It consists of five sub-waves, with three being motive waves and the other two being corrective waves. After wave one, wave two cannot retrace more than wave one. Wave three must not be the shortest wave among waves 1, 3, and 5. Moreover, wave four shouldn’t encroach on the price territory covered by wave 1, while wave five should conclude with a discernible divergence in momentum, indicating a change in the rate of acceleration or price movement.",
    "image": "images/Elliott_Wave.jpg",
    "content_2": "Corrective waves, also known as diagonal waves, are three sub-waves or a combination thereof. Together these waves move in a direction that is different from the trend of the next-largest degree. These waves try to facilitate a market movement aligned with the prevailing trend. Overall, the theory is a nuanced approach to understanding and predicting price movements in the market, using the different wave pattern to predict the flow of the market. It is a very useful tool that helps different analysts and traders interpret trends and make positive trades in the market."
  },
  {
    "title": "7. Head and Shoulders",
    "content_1": "The head and shoulders pattern in markets is one of the most well-known patterns for traders. It's a pattern that depicts a baseline with three peaks, with the middle one being the highest. This pattern illustrates a transition in the market from a bullish to bearish reversal, or vice versa, indicating an impending market reversal. It's a universally recognized pattern that can be utilized by traders of all levels. It's considered one of the best patterns to learn, especially for beginners, due to its ease of identification.\n\nWhen observed at the market's peak, the left shoulder should indicate a price rise, followed by a peak in price and then a decline. The head should subsequently rise above the level of the left shoulder, and finally, the right shoulder should decline lower than the head.",
    "image": "images/head_and_shoulders.png",
    "content_2": "At the bottom of the market, the left shoulder displays a decline, forming a price low, which is followed by an increase. Following this, the head phase arrives, where prices decline even further, dropping below the level of the left shoulder and creating a new bottom. Finally, the right shoulder comes into play, beginning with an increase once again and then declining to establish the right bottom.\n\nIt's crucial to exercise caution and act on this pattern only when it has fully completed its cycle. This entails waiting until the neckline is breached before making a move. Acting too early can lead to inaccurate decisions based on incomplete data. Essentially, you're waiting for the price to dip below the neckline after the peak of the right shoulder."
  },
  {
    "title": "8. Rounding Top Pattern",
    "content_1": "A rounding top is a pattern used by traders to spot the high points on a chart where the graph forms a curving line sloping downwards. It suggests that a peak has been reached after a period of going up. This pattern can take shape over days, weeks, or months. It's the opposite of a rounded bottom pattern. When this happens over a long time, it can indicate a trend that will last for a while. It looks like a reversed saucer. The main goal is to predict a big change in the market from being positive (bullish) to being negative (bearish). There are three main parts to it. First, the price goes up, then slows down and goes down. Second, the amount of trading is high at the start and end, but low in the middle. Finally, the price at the bottom of the shape is the support level.",
    "image": "images/roundingtop.png",
    "content_2": "When the price goes up and then comes down in a specific manner, it forms a shape like a \"U.\" In this situation, the price might reach a new high and then begin to drop. Traders with more experience often do a lot of trading at these points. It's important to understand that you might see multiple rounding tops, and these can actually be part of a much bigger rounding top pattern. It's wise to be cautious because a rounding top suggests that the market is going to shift from being bullish to bearish."
  },
  {
    "title": "9. Rounding Bottom Pattern",
    "content_1": "A rounding bottom is a pattern used to signal an upcoming market change in prices. It appears after the price has been falling for some time. This pattern suggests that the market is about to shift from a downtrend to an uptrend. It takes a few days, weeks, or even months to form and can sometimes be hard to spot. The initial downward slope of the pattern indicates an excess of supply, which causes the market price to increase significantly. Once the pattern is complete, the price breaks free from the previous decline and starts moving upward. This pattern indicates a market reversal, shifting from a bearish market to a bullish one.",
    "image": "images/roundingbottom.png",
    "content_2": "A rounding bottom pattern can be divided into a few different parts. The first one is how the price originally decreased. At the start of this decrease, there is a lot of volume leaving the market. Once the trading slows down, the market starts to level off. As the stock begins to rise again, more people buy shares, so the trading increases. The pattern breaks out from its lowest level when the stock's price closes higher than the price right before it started falling. When trading in relation to this pattern, one should ideally trade in the same direction as the market is heading, but it does not have to be perfectly timed. Overall, a rounded bottom pattern is an indication of a market reversal from a bearish market to a bullish one, marked by a U-shaped chart."
  },
  {
    "title": "10. Wedge",
    "content_1": "A wedge pattern is a market pattern characterized by two distinct trend lines that converge on a chart. These trend lines represent the highs and lows observed over a span of 10 to 50 trading periods. The purpose of this pattern is to provide insight into whether the ongoing trend is inclined towards being high or low, or whether it is undergoing a shift towards decline or ascent. The convergence of the lines eventually confirms one of these scenarios. These patterns are often renowned for their efficacy in forecasting price reversals compared to other patterns in the market.\n\nA \"rising wedge\" occurs when the price has been progressively increasing over time. However, it's important to note that this pattern can also manifest when the market is experiencing a downward trend. It's worth mentioning that wedge patterns frequently break out in a direction that is contrary to the prevailing trend line. Due to this behavior, in the context of a rising wedge, there's a higher probability of the price decreasing after a breakout of the lower trend line. This serves as a potential indication of a forthcoming decline in price.",
    "image": "images/wedge.png",
    "content_2": "A \"falling wedge\" emerges when the price within the market has experienced a downward trend over a certain period, and the pattern takes shape as the trend reaches its concluding downward phase. In this pattern, one of the trend lines is drawn above the highs, and the other is positioned below the lows on the chart. As these trend lines converge, it occurs as the price's momentum begins to weaken. This convergence provides an opportunity for potential buyers, as the price might initiate a breakout above the upper trend line, initiating a potential bullish move. This breakout leads to an upward price movement.\n\nA wedge pattern is indicative of a potential reversal. Depending on the specific configuration of the trend lines and their convergence, this reversal could either be bearish or bullish. The direction of the reversal hinges on the interaction of these trend lines. In summary, the wedge pattern is a robust tool within a trader's toolkit, capable of offering valuable insights into potential market reversals and trend shifts."
  }
]